Oliveryang258/CH32H417-Drone/EXAM/SRC/Debug/debug.h
/********************************** (C) COPYRIGHT  *******************************
* File Name          : debug.h
* Author             : WCH
* Version            : V1.0.1
* Date               : 2025/09/16
* Description        : This file contains all the functions prototypes for UART
*                      Printf , Delay functions.
*********************************************************************************
* Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#ifndef __DEBUG_H
#define __DEBUG_H

#ifdef __cplusplus
 extern "C" {
#endif

#include "stdio.h"
#include "ch32h417.h"

/* UART Printf Definition */
#define DEBUG_UART1    1
#define DEBUG_UART8    2
#define DEBUG_UART6    3
#define DEBUG_UART4    4//�Լ��Ӹ�����

/* DEBUG UATR Definition */
#ifndef DEBUG

#ifdef Core_V3F
#define DEBUG   DEBUG_UART8

#elif defined(Core_V5F)
/*
 * V5F printf 已禁用（值 0xFF 不匹配任何 DEBUG_UARTx，让 printf 编译成空）。
 * 原因：V5F 之前用 USART3 (PA13/PA14)，与 V3F 上的 VOFA+ HC-06 同一个物理引脚，
 * 双核同时往同一个外设写数据会冲突，导致 VOFA 收到 ASCII 与二进制混合的乱码流。
 * V5F 的所有外设状态可通过共享内存反映给 V3F 后再 VOFA 输出。
 */
#define DEBUG   0xFF

#endif

#endif

/* Run Core Definition */
#define Run_Core_V3F         0
#define Run_Core_V5F         1
#define Run_Core_V3FandV5F   2

#ifndef Run_Core
#define Run_Core   Run_Core_V3FandV5F
// #define Run_Core   Run_Core_V5F
// #define Run_Core   Run_Core_V3F
#endif

/* Core start addrress Definition */
#ifndef Core_V3F_StartAddr
#define Core_V3F_StartAddr   0x00000000
#endif

#ifndef Core_V5F_StartAddr
#define Core_V5F_StartAddr   0x00010000
#endif

#if ((Run_Core == Run_Core_V3FandV5F) || (Run_Core == Run_Core_V5F)) && defined(Core_V5F) 
#define Func_Run_V5F 1
#define Func_Run_V3F 0
#elif ((Run_Core == Run_Core_V3FandV5F) || (Run_Core == Run_Core_V3F)) && defined(Core_V3F)
#define Func_Run_V5F 0
#define Func_Run_V3F 1
#else
#define Func_Run_V5F 0
#define Func_Run_V3F 0
#endif

extern volatile uint32_t WFE_WkupSource;

void Delay_Init(void);
void Delay_Us (uint32_t n);
void Delay_Ms (uint32_t n);
void USART_Printf_Init(uint32_t baudrate);

#ifdef __cplusplus
}
#endif

#endif 



